иб/src/Catalogs/МатеринскаяЛиния/МатеринскаяЛиния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МатеринскаяЛиния</name>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отбор</name>
    <type>
      <types>EnumRef.отбор</types>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>CatalogRef.Год</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеТомата</name>
    <type>
      <types>CatalogRef.НазваниеТомата</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРоста</name>
    <type>
      <types>EnumRef.ТипРоста</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТомата</name>
    <type>
      <types>EnumRef.ТипТомата</types>
    </type>
  </attributes>
  <attributes>
    <name>весПлода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Окраска</name>
    <type>
      <types>EnumRef.ПлодОкраскаПриСозревании</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаПлода</name>
    <type>
      <types>EnumRef.ФормаПлода</types>
    </type>
  </attributes>
  <attributes>
    <name>Сочленение</name>
    <type>
      <types>EnumRef.СочленениеПлодаСПлодоножкой</types>
    </type>
  </attributes>
  <attributes>
    <name>Пятно</name>
    <type>
      <types>EnumRef.Пятно</types>
    </type>
  </attributes>
  <attributes>
    <name>СилаРоста</name>
    <type>
      <types>EnumRef.СилаРоста</types>
    </type>
  </attributes>
  <attributes>
    <name>Сеянец</name>
    <type>
      <types>EnumRef.СеянецАнтоциановаяОкраскаГипокотиля_NN_РФ_3</types>
    </type>
  </attributes>
  <attributes>
    <name>СеменаОпушение</name>
    <type>
      <types>EnumRef.СеменаОпушение_NNРФ_2</types>
    </type>
  </attributes>
  <attributes>
    <name>СеменаОкраска</name>
    <type>
      <types>EnumRef.СеменаОкраска_NNРФ_1</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветокОкраска</name>
    <type>
      <types>EnumRef.ЦветокОкраска</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаQRКода</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТекста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Посев</name>
    <type>
      <types>CatalogRef.Год</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>CatalogRef.Фото</types>
    </type>
  </attributes>
  <attributes>
    <name>МатеринскаяЛиния</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтцовскаяЛиния</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаГенов</name>
    <attributes>
      <name>Gene</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>110</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GeneName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>110</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Allele</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>110</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AlleleName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>110</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Synonyms</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>110</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Phenotype</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>110</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Notes</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>About</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

иб/src/Documents/РЕЕСТР_Коллекция/РЕЕСТР_Коллекция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РЕЕСТР_Коллекция</name>
  <registerRecords>InformationRegister.ИсторияОтцовскихЛиний</registerRecords>
  <registerRecords>InformationRegister.СерииНомеров</registerRecords>
  <registerRecords>InformationRegister.ИсторияМатеринскихЛиний</registerRecords>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отбор</name>
    <type>
      <types>EnumRef.отбор</types>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>CatalogRef.Год</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеТомата</name>
    <type>
      <types>CatalogRef.НазваниеТомата</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРоста</name>
    <type>
      <types>EnumRef.ТипРоста</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТомата</name>
    <type>
      <types>EnumRef.ТипТомата</types>
    </type>
  </attributes>
  <attributes>
    <name>весПлода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Окраска</name>
    <type>
      <types>EnumRef.ПлодОкраскаПриСозревании</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаПлода</name>
    <type>
      <types>EnumRef.ФормаПлода</types>
    </type>
  </attributes>
  <attributes>
    <name>Сочленение</name>
    <type>
      <types>EnumRef.СочленениеПлодаСПлодоножкой</types>
    </type>
  </attributes>
  <attributes>
    <name>Пятно</name>
    <type>
      <types>EnumRef.Пятно</types>
    </type>
  </attributes>
  <attributes>
    <name>СилаРоста</name>
    <type>
      <types>EnumRef.СилаРоста</types>
    </type>
  </attributes>
  <attributes>
    <name>Сеянец</name>
    <type>
      <types>EnumRef.СеянецАнтоциановаяОкраскаГипокотиля_NN_РФ_3</types>
    </type>
  </attributes>
  <attributes>
    <name>СеменаОпушение</name>
    <type>
      <types>EnumRef.СеменаОпушение_NNРФ_2</types>
    </type>
  </attributes>
  <attributes>
    <name>СеменаОкраска</name>
    <type>
      <types>EnumRef.СеменаОкраска_NNРФ_1</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветокОкраска</name>
    <type>
      <types>EnumRef.ЦветокОкраска</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаQRКода</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТекста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Посев</name>
    <type>
      <types>CatalogRef.Год</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>CatalogRef.Фото</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаГенов</name>
    <attributes>
      <name>Gene</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>110</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GeneName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>110</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Allele</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>110</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AlleleName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>110</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Synonyms</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>110</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Phenotype</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>110</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Notes</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>About</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

иб/src/Catalogs/МатеринскаяЛиния/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.РЕЕСТР_Коллекция.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РЕЕСТР_Коллекция.весПлода,
	|	РЕЕСТР_Коллекция.ВыборГенов,
	|	РЕЕСТР_Коллекция.Год,
	|	РЕЕСТР_Коллекция.Дата,
	|	РЕЕСТР_Коллекция.КартинкаQRКода,
	|	РЕЕСТР_Коллекция.НазваниеТомата,
	|	РЕЕСТР_Коллекция.Номер,
	|	РЕЕСТР_Коллекция.Окраска,
	|	РЕЕСТР_Коллекция.Описание,
	|	РЕЕСТР_Коллекция.Отбор,
	|	РЕЕСТР_Коллекция.Посев,
	|	РЕЕСТР_Коллекция.Пятно,
	|	РЕЕСТР_Коллекция.РегистрационныйНомер,
	|	РЕЕСТР_Коллекция.СеменаОкраска,
	|	РЕЕСТР_Коллекция.СеменаОпушение,
	|	РЕЕСТР_Коллекция.Сеянец,
	|	РЕЕСТР_Коллекция.СилаРоста,
	|	РЕЕСТР_Коллекция.Сочленение,
	|	РЕЕСТР_Коллекция.ТипРоста,
	|	РЕЕСТР_Коллекция.ТипТекста,
	|	РЕЕСТР_Коллекция.ТипТомата,
	|	РЕЕСТР_Коллекция.ФормаПлода,
	|	РЕЕСТР_Коллекция.Фото,
	|	РЕЕСТР_Коллекция.ЦветокОкраска,
	|	РЕЕСТР_Коллекция.ТаблицаГенов.(
	|		Gene,
	|		GeneName
	|	)
	|ИЗ
	|	Документ.РЕЕСТР_Коллекция КАК РЕЕСТР_Коллекция
	|ГДЕ
	|	РЕЕСТР_Коллекция.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТаблицаГеновШапка = Макет.ПолучитьОбласть("ТаблицаГеновШапка");
	ОбластьТаблицаГенов = Макет.ПолучитьОбласть("ТаблицаГенов");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТаблицаГеновШапка);
		ВыборкаТаблицаГенов = Выборка.ТаблицаГенов.Выбрать();
		Пока ВыборкаТаблицаГенов.Следующий() Цикл
			ОбластьТаблицаГенов.Параметры.Заполнить(ВыборкаТаблицаГенов);
			ТабДок.Вывести(ОбластьТаблицаГенов, ВыборкаТаблицаГенов.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
